src/tools-usb-stick.org
#+TITLE: 随身USB盘

程序员需要一个大容量USB盘, 上面做好了Debian, Redhat, CentOS, Win 7, Win 10, 及
自启动系统.

* 工作原理
用[[https://www.gnu.org/software/grub/][GRUB]]和[[https://sourceforge.net/projects/grub4dos/][grub4dos]]提供多系统安装, 使用[[http://www.linuxfromscratch.org/][linux from scratch]]制作自启动系统.

* 制作方式
** 分区
使用fdisk分区. part1用做grub, part2用做live linux, part3用做Linux安装系统, part4
是扩展分区, part5/6分别用做win安装盘和win下数据盘. 各分区大小根据USB和安装盘
大小进行随意调整. 如下是64GB USB示例:
#+BEGIN_SRC shell
  yanyg@t:~$ sudo fdisk -l /dev/sdc

  Disk /dev/sdc: 57.9 GiB, 62109253632 bytes, 121307136 sectors
  Units: sectors of 1 * 512 = 512 bytes
  Sector size (logical/physical): 512 bytes / 512 bytes
  I/O size (minimum/optimal): 512 bytes / 512 bytes
  Disklabel type: dos
  Disk identifier: 0xcad4ebea

  Device     Boot     Start       End  Sectors  Size Id Type
  /dev/sdc1            2048  33556479 33554432   16G 83 Linux
  /dev/sdc2        33556480  75499519 41943040   20G 83 Linux
  /dev/sdc3        75499520  88082431 12582912    6G 83 Linux
  /dev/sdc4        88082432 121307135 33224704 15.9G  5 Extended
  /dev/sdc5        88084480 100667391 12582912    6G  7 HPFS/NTFS/exFAT
  /dev/sdc6       100669440 121307135 20637696  9.9G  7 HPFS/NTFS/exFAT
#+END_SRC
