tools-usb-stick.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-01 Wed 09:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>随身USB盘</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="U-HOME\yanyg" />
<link rel="shortcut icon" href="http://ycode.org/css/favicon.ico" />
<link rel="stylesheet" type="text/css" href="css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">随身USB盘</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga06ba02">1. 工作原理</a></li>
<li><a href="#org47bad45">2. 制作方式</a>
<ul>
<li><a href="#orgb9bcd6b">2.1. 分区</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
程序员需要一个大容量USB盘, 上面做好了Debian, Redhat, CentOS, Win 7, Win 10, 及
自启动系统.
</p>

<div id="outline-container-orga06ba02" class="outline-2">
<h2 id="orga06ba02"><span class="section-number-2">1</span> 工作原理</h2>
<div class="outline-text-2" id="text-1">
<p>
用<a href="https://www.gnu.org/software/grub/">GRUB</a>和<a href="https://sourceforge.net/projects/grub4dos/">grub4dos</a>提供多系统安装, 使用<a href="http://www.linuxfromscratch.org/">linux from scratch</a>制作自启动系统.
</p>
</div>
</div>

<div id="outline-container-org47bad45" class="outline-2">
<h2 id="org47bad45"><span class="section-number-2">2</span> 制作方式</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgb9bcd6b" class="outline-3">
<h3 id="orgb9bcd6b"><span class="section-number-3">2.1</span> 分区</h3>
<div class="outline-text-3" id="text-2-1">
<p>
使用fdisk分区. part1用做grub, part2用做live linux, part3用做Linux安装系统, part4
是扩展分区, part5/6分别用做win安装盘和win下数据盘. 各分区大小根据USB和安装盘
大小进行随意调整. 如下是64GB USB示例:
</p>
<div class="org-src-container">
<pre class="src src-shell">yanyg@t:~$ sudo fdisk -l /dev/sdc

Disk /dev/sdc: 57.9 GiB, 62109253632 bytes, 121307136 sectors
Units: sectors of 1 * 512 = 512 bytes
Sector size (logical/physical): 512 bytes / 512 bytes
I/O size (minimum/optimal): 512 bytes / 512 bytes
Disklabel type: dos
Disk identifier: 0xcad4ebea

Device     Boot     Start       End  Sectors  Size Id Type
/dev/sdc1            2048  33556479 33554432   16G 83 Linux
/dev/sdc2        33556480  75499519 41943040   20G 83 Linux
/dev/sdc3        75499520  88082431 12582912    6G 83 Linux
/dev/sdc4        88082432 121307135 33224704 15.9G  5 Extended
/dev/sdc5        88084480 100667391 12582912    6G  7 HPFS/NTFS/exFAT
/dev/sdc6       100669440 121307135 20637696  9.9G  7 HPFS/NTFS/exFAT
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Created by yanyg(<a href="mailto:yygcode@gmail.com">yygcode@gmail.com</a>)</p> <div id="disqus_thread"></div> <script type="text/javascript"> var disqus_shortname = 'yanyg'; (function() {  var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);  })(); </script>
</div>
</body>
</html>
